package com.bin.meishikecan.utils;

import com.alibaba.fastjson.JSONArray;
import org.apache.http.HttpEntity;
import org.apache.http.NameValuePair;
import org.apache.http.client.entity.UrlEncodedFormEntity;
import org.apache.http.client.methods.CloseableHttpResponse;
import org.apache.http.client.methods.HttpPost;
import org.apache.http.impl.client.CloseableHttpClient;
import org.apache.http.impl.client.HttpClients;
import org.apache.http.message.BasicNameValuePair;
import org.apache.http.util.EntityUtils;

import java.io.IOException;
import java.io.UnsupportedEncodingException;
import java.nio.charset.Charset;
import java.util.*;

public class GoogleTranslate {

    private static final String PATH="https://translate.googleapis.com/translate_a/single"; //地址
    private static final String CLIENT="gtx";

    private static final String USER_AGENT="Mozilla/5.0";//"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/60.0.3112.113 Safari/537.36";

    /**
     * 翻译文本
     * @param text  文本内容
     * @param sourceLang  文本所属语言。如果不知道，可以使用auto
     * @param targetLang  目标语言。必须是明确的有效的目标语言
     * @return
     * @throws Exception
     */
    public static String translateText(String text,String sourceLang, String targetLang) throws Exception{

        String retStr="";

        List<NameValuePair> nvps = new ArrayList();
        nvps.add(new BasicNameValuePair("client", CLIENT));
        nvps.add(new BasicNameValuePair("sl", sourceLang));
        nvps.add(new BasicNameValuePair("tl", targetLang));
        nvps.add(new BasicNameValuePair("dt", "t"));
        nvps.add(new BasicNameValuePair("q", text));
        String resp =  postHttp( PATH,nvps);
        if( null == resp ){
            throw  new Exception("网络异常");
        }
        JSONArray jsonObject = JSONArray.parseArray( resp );
        for (Iterator<Object> it = jsonObject.getJSONArray(0).iterator(); it.hasNext(); ) {
            JSONArray a = (JSONArray) it.next();
            retStr += a.getString(0);
        }

        return retStr;
    }


    /**
     * post 请求
     * @param url 请求地址
     * @param nvps 参数列表
     * @return
     * @throws UnsupportedEncodingException
     */
    private static String postHttp( String url ,List<NameValuePair> nvps){
        String responseStr = null;
        CloseableHttpClient httpclient = HttpClients.createDefault();
        HttpPost httpPost = new HttpPost( url );
        //重要！！必须设置 http 头，否则返回为乱码
        httpPost.setHeader("User-Agent",USER_AGENT);
        CloseableHttpResponse response2 = null;
        try {
            // 重要！！ 指定编码，对中文进行编码
            httpPost.setEntity( new UrlEncodedFormEntity(nvps, Charset.forName("UTF-8"))  );
            response2 = httpclient.execute(httpPost);
            HttpEntity entity2 = response2.getEntity();
            responseStr = EntityUtils.toString(entity2);
            EntityUtils.consume(entity2);
        } catch (IOException e) {
            e.printStackTrace();
        } finally {
            if (null != response2) {
                try {
                    response2.close();
                } catch (IOException e) {
                    e.printStackTrace();
                }
            }
            if( null != httpclient ){
                try {
                    httpclient.close();
                } catch (IOException e) {
                    e.printStackTrace();
                }
            }
        }
        return responseStr;
    }

    public static void main(String[] args) throws Exception{
        String th = GoogleTranslate.translateText("9 ที่พักใกล้สะพานมอญ สังขละบุรี เอนกายเข้าหาธรรมชาติ ยิ้มรับความสุข\n" +
                "11,824อ่าน\n" +
                "862\n" +
                "          ที่พักใกล้สะพานมอญ สังขละบุรี เต็มอิ่มกับบรรยากาศความชิล เหมาะสำหรับเป็นสถานที่ท่องเที่ยวพักผ่อน ตักตวงความสุข ปลดปล่อยความเหนื่อยล้าต่าง ๆ ที่ผ่านมา\n" +
                "          หลังจากสถานการณ์โควิด 19 ในไทยผ่านพ้นไป เชื่อว่าหลายคนน่าจะโหยหาการเที่ยวอยู่แน่ ๆ ยิ่งช่วงนี้ที่ยังเดินทางไปเที่ยวต่างประเทศไม่ได้ ก็ลองมาเที่ยวไทยก่อนก็ดีนะคะ หลายจังหวัด หลายสถานที่ท่องเที่ยว ได้เริ่มทยอยเปิดให้เช็กอินกันแล้ว ถ้าอย่างนั้นวันนี้ เราจะพาทุกคนไปปล่อยกายปล่อยใจชิล ๆ กับที่พักใกล้สะพานมอญ อำเภอสังขละบุรี จังหวัดกาญจนบุรี กัน ชิลไปกับธรรมชาติ สายหมอก และวิถีชีวิต ที่แสนเรียบง่าย สงบ พร้อมให้ทุกคนมาสัมผัส\n" +
                "1. P-Guesthouse and Country Resort\n" +
                "          ที่พักบรรยากาศดีที่พร้อมให้คุณเดินทางมาสัมผัสธรรมชาติและวิถีชีวิตรอบสะพานมอญ พร้อมให้บริการบ้านพักในสไตล์บ้านหิน แต่ไม่ลืมแฝงลูกเล่นการตกแต่งด้วยเครื่องไม้ ห้องพักกว้างขวาง พร้อมสิ่งอำนวยความสะดวกต่าง ๆ วิวดีติดริมทะเลสาบ มองออกไปเบื้องหน้าเห็นวิววัดหลวงพ่ออุตตมะ เจดีย์พุทธคยา ชุมชนชาวมอญ รวมถึงแหล่งท่องเที่ยวสำคัญอื่น ๆ เดินทางสะดวก นอนหลับสบาย เสพวิวธรรมชาติให้ฉ่ำปอดกันไปข้าง\n" +
                "ภาพจาก เฟซบุ๊ก P-Guesthouse and Country Resort\n" +
                "ภาพจาก เฟซบุ๊ก P-Guesthouse and Country Resort\n" +
                "          ที่อยู่ : หมู่ 1 ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 081 450 2783, 034 595 061\n" +
                "          เฟซบุ๊ก : P-Guesthouse and Country Resort\n" +
                "2. บ้านไอหมอก\n" +
                "          ที่พักบรรยากาศเรียบง่ายและเป็นกันเอง มาพร้อมด้วยสิ่งอำนวยความสะดวกต่าง ๆ พร้อมให้คุณมีเวลาดื่มด่ำกับธรรมชาติและวิถีชีวิตใกล้สะพานมอญอย่างเต็มที่ ไม่ว่าจะมาเป็นกลุ่มเพื่อน คนรัก หรือครอบครัว ก็เหมาะสำหรับทุกคน ตื่นเช้ามาก็สามารถท่องเที่ยวไปยังสถานที่สำคัญต่าง ๆ ได้เลย ใครที่กำลังมองหาที่พักชิล ๆ สักที่ใกล้สะพานมอญ ลองดูที่นี่เป็นหนึ่งในตัวเลือกก็ดีไม่น้อยเลย\n" +
                "ภาพจาก เฟซบุ๊ก บ้านไอหมอกสังขละบุรี\n" +
                "ภาพจาก เฟซบุ๊ก บ้านไอหมอกสังขละบุรี\n" +
                "          ที่อยู่ : ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 081 493 3377\n" +
                "          เฟซบุ๊ก : บ้านไอหมอกสังขละบุรี\n" +
                "3. Cat and Oil Home\n" +
                "          ที่พักใกล้สะพานมอญที่พร้อมทำให้คุณประทับใจตลอดคืนของการพักผ่อน เรียบง่าย สะดวกสบาย และเป็นกันเอง ภายในห้องพักสะอาด พร้อมด้วยสิ่งอำนวยความสะดวกครบครัน เช่น เครื่องปรับอากาศ, พัดลม, ตู้เย็น, เครื่องทำน้ำอุ่น, ทีวี และอินเทอร์เน็ต แถมยังมีระเบียงไว้เป็นพื้นที่ให้คุณออกมานั่งชิล ชื่นชมกับบรรยากาศความสวยงามรอบข้างอีกด้วย\n" +
                "ภาพจาก เฟซบุ๊ก Cat and Oil Home\n" +
                "ภาพจาก เฟซบุ๊ก Cat and Oil Home\n" +
                "          ที่อยู่ : ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 089 815 8440\n" +
                "          เฟซบุ๊ก : Cat and Oil Home\n" +
                "4. Burmese Inn Resort\n" +
                "          ที่พักใกล้สะพานมอญเพียง 200 เมตร พร้อมให้บริการที่พักหลากหลายประเภทห้อง ไม่ว่าจะเป็น ซูพีเรียวิวสะพานมอญ, ห้องแอร์มาตรฐาน, บังกะโลแอร์ห้องแฝด, บังกะโลแอร์แบบครอบครัว, บังกะโลแอร์หลังเดี่ยว และห้องพัดลมเรือนแถว เพียบพร้อมด้วยสิ่งอำนวยความสะดวกต่าง ๆ รวมถึงยังได้ลิ้มรสอาหารไทยและอาหารพม่าแห่งเดียวในอำเภอสังขละบุรี รียกได้ว่านอนสบาย แถมพ่วงด้วยความอิ่มท้องอีกด้วย\n" +
                "ภาพจาก เฟซบุ๊ก Burmese Inn Resort\n" +
                "ภาพจาก เฟซบุ๊ก Burmese Inn Resort\n" +
                "          ที่อยู่ : ซอยศรีสุวรรณคีรี 1 ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 086 168 1801\n" +
                "          เฟซบุ๊ก : Burmese Inn Resort\n" +
                "          เว็บไซต์ : burmese-inn.com\n" +
                "5. สังขละรีสอร์ท\n" +
                "          พักผ่อนกับบรรยากาศธรรมชาติแห่งอำเภอสังขละบุรี มีห้องพักให้นักท่องเที่ยวเลือกพักหลากหลายสไตล์ หลากหลายราคา แล้วแต่ว่าถูกใจแบบไหน ก็เลือกที่ตอบโจทย์คุณได้เลย มีทั้งเตียงเดี่ยว สองเตียง หรือทั้งครอบครัว ภายในห้องพักตกแต่งอย่างเรียบง่าย เน้นความสะดวกสบายเป็นหลัก นั่นก็เพื่อให้ทุกคนได้ตักตวงความชิลกันให้เต็มที่ รวมถึงความสุขที่ทุกคนจะได้รับกลับไปด้วยแน่นอน\n" +
                "ภาพจาก เฟซบุ๊ก สังขละ รีสอร์ท - Sangkla Resort\n" +
                "ภาพจาก เฟซบุ๊ก สังขละ รีสอร์ท - Sangkla Resort\n" +
                "          ที่อยู่ : หมู่ที่ 1 ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 085 181 5777, 034 595 060\n" +
                "          เฟซบุ๊ก : สังขละ รีสอร์ท - Sangkla Resort\n" +
                "          เว็บไซต์ : sangklaresorts.com\n" +
                "6. Kru. guest house\n" +
                "          ที่พักรายล้อมด้วยธรรมชาติ แฝงด้วยกลิ่นอายวิถีชีวิตชาวมอญ ราคาไม่แพง อีกทั้งยังอยู่ไม่ไกลจากสถานที่ท่องเที่ยว หลากหลายประเภทห้องพักพร้อมให้บริการ เช่น ห้องแอร์, ห้องพักแบบห้องน้ำรวม และห้องแอร์ห้องน้ำรวม ภายในห้องพักแต่ละห้องตกแต่งอย่างเรียบง่ายและสะอาด ตื่นขึ้นมาตอนเช้าสามารถตักบาตรได้ที่สะพานมอญ รวมถึงสัมผัสความสโลว์ไลฟ์ของผู้คนได้แบบไม่รู้เบื่อ\n" +
                "ภาพจาก เฟซบุ๊ก Kru. guest house - ครู เกสท์เฮ้าส์ สังขละบุรี sangkhlaburi\n" +
                "ภาพจาก เฟซบุ๊ก Kru. guest house - ครู เกสท์เฮ้าส์ สังขละบุรี sangkhlaburi\n" +
                "          ที่อยู่ : ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 087 052 1812\n" +
                "          เฟซบุ๊ก : Kru. guest house - ครู เกสท์เฮ้าส์ สังขละบุรี sangkhlaburi\n" +
                "7. แพเคียงหมอก\n" +
                "          ที่พักแพริมน้ำสุดชิล ความดีงามของการเข้าพักที่นี่ นั่นคือ คุณสามารถกระโดดเล่นน้ำหน้าแพได้เลย ยิ่งถ้าช่วงไหนที่มีหมอกลง ความสวยงามของที่นี่จะเพิ่มขึ้นเป็นอีกเท่าตัว ห้องพักมีให้เลือก 2 แบบ คือ ห้องพัก (ประกอบด้วยพัดลม ทีวี และที่นอน) และแบบเต็นท์ ชอบหรือถูกใจแบบไหน ก็เลือกกันได้ตามใจชอบ ยิ่งถ้าชวนเพื่อนไปเที่ยวเยอะ ๆ น่าจะสนุกมากกว่าเดิมอย่างแน่นอน\n" +
                "ภาพจาก เฟซบุ๊ก แพเคียงหมอกสังขละบุรี\n" +
                "ภาพจาก เฟซบุ๊ก แพเคียงหมอกสังขละบุรี\n" +
                "          ที่อยู่ : ซอยศรีสุวรรณคีรี 1 ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 081 493 3377\n" +
                "          เฟซบุ๊ก : แพเคียงหมอกสังขละบุรี\n" +
                "8. Forget me not house resort\n" +
                "          ที่พักสไตลบ้านพักติดริมแม่น้ำ บรรยากาศเงียบสงบใกล้ชิดธรรมชาติ เหมาะแก่การพักผ่อน มีบริการทั้งบ้านหลังใหญ่ บ้านหลังเล็กและห้องพักริมแม่น้ำ ตอบสนองความต้องการของลูกค้าทุกกลุ่ม พร้อมกิจกรรมนั่งเรือชมวัด และกิจกรรมนั่งเรือตกปลาในเขื่อน รวมถึงมีจักรยานให้เช่าชื่นชมวิถีชีวิตผู้คน ที่แสนจะมีเสน่ห์และน่าค้นหา พร้อมให้คุณตกหลุมรักได้อย่างง่ายดาย\n" +
                "\n" +
                "          ที่อยู่ : ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 034 595 015, 097 920 6785\n" +
                "          เฟซบุ๊ก : Forget me not house resort สังขละบุรี\n" +
                "9. บุญเสริมเติมสุข รีสอร์ท\n" +
                "          ที่พักบริเวณสะพานมอญ บรรยากาศสบาย ๆ ชิล ๆ แถมบริการดีเยี่ยม พ่วงด้วยความเป็นกันเองสุด ๆ ที่พักรายล้อมด้วยธรรมชาติสุดเอ็กซ์คลูซีฟ เรียกได้ว่าเรียกพลังความสดชื่นกันอย่างเต็มที่ ยิ่งถ้าใครมาเที่ยวช่วงหน้าฝน ก็จะได้ฟีลการพักผ่อนที่ต่างไปจากเดิม ใครอยากรู้ว่าเป็นยังไง เห็นทีต้องลองเข้ามาพักสักคืนสองคืน รับรองไม่ผิดหวัง\n" +
                "ภาพจาก เฟซบุ๊ก บุญเสริมเติมสุข รีสอร์ท สังขละบุรี\n" +
                "ภาพจาก เฟซบุ๊ก บุญเสริมเติมสุข รีสอร์ท สังขละบุรี\n" +
                "          ที่อยู่ : ตำบลหนองลู อำเภอสังขละบุรี จังหวัดกาญจนบุรี\n" +
                "          เบอร์โทรศัพท์ : 081 743 6474\n" +
                "          เฟซบุ๊ก : บุญเสริมเติมสุข รีสอร์ท สังขละบุรี\n" +
                "\n" +
                "          ใครที่กำลังโหยหาการเที่ยวและอยากพักผ่อนท่ามกลางการโอบกอดของธรรมชาติ ที่พักใกล้สะพานมอญถือเป็นอีกหนึ่งตัวเลือกที่น่าสนใจ ลองหาวันหยุดสักวันสองวัน สะกิดคนข้าง ๆ แล้วเก็บกระเป๋าออกเดินทางกันค่ะ ^ ^\n" +
                "ขอบคุณข้อมูลจาก\n" +
                "เฟซบุ๊ก P-Guesthouse and Country Resort, เฟซบุ๊ก บ้านไอหมอกสังขละบุรี, เฟซบุ๊ก Cat and Oil Home, เฟซบุ๊ก Burmese Inn Resort, เฟซบุ๊ก Kru. guest house - ครู เกสท์เฮ้าส์ สังขละบุรี sangkhlaburi, เฟซบุ๊ก แพเคียงหมอกสังขละบุรี, เฟซบุ๊ก Forget me not house resort สังขละบุรี, เฟซบุ๊ก บุญเสริมเติมสุข รีสอร์ท สังขละบุรี, เฟซบุ๊ก บุญเสริมเติมสุข รีสอร์ท สังขละบุรี\n" +
                "รวมรูปภาพ 9 ที่พักใกล้สะพานมอญ สังขละบุรี เอนกายเข้าหาธรรมชาติ ยิ้มรับความสุข\n" +
                "11+\n" +
                "ประเด็นที่เกี่ยวข้อง\n" +
                "ที่พักกาญจนบุรี", "th", "zh-cn");

        System.out.println(th);
    }


}